'''
모든 탑의 레이저 송신기는 레이저 신호를 지표면과 평행하게 수평 직선의 왼쪽 방향으로 발사하고, 
탑의 기둥 모두에는 레이저 신호를 수신하는 장치가 설치되어 있다. 
하나의 탑에서 발사된 레이저 신호는 가장 먼저 만나는 단 하나의 탑에서만 수신이 가능하다. 

탑들의 개수 N과 탑들의 높이가 주어질 때, 
각각의 탑에서 발사한 레이저 신호를 어느 탑에서 수신하는지를 알아내는 프로그램을 작성하라. 

첫째 줄에 주어진 탑들의 순서대로 각각의 탑들에서 발사한 레이저 신호를 수신한 탑들의 번호를 하나의 빈칸을 사이에 두고 출력한다. 
만약 레이저 신호를 수신하는 탑이 존재하지 않으면 0을 출력한다.
'''
# 송신하는 높이의 탑보다 위에 있는 탑이 수신 받음

n=int(input())
tower=list(map(int, input().split()))

ans=[0]*n
stack=[[0,0]]

# 앞에서부터 접근
for i in range(n):  
        
    while stack:    
        if tower[i]>stack[-1][0]:
            stack.pop()
        else:
            ans[i]=stack[-1][1]
            break
        
    stack.append([tower[i],i+1]) # 현재 tower 정보 추가
    
print(" ".join(map(str,ans)))
